[{"model": "school.course", "pk": 1, "fields": {"name": "Python", "description": "Python (МФА: [ˈpʌɪθ(ə)n]; в русском языке встречаются названия пито́н[23] или па́йтон[24]) — высокоуровневый язык программирования общего назначения с динамической строгой типизацией и автоматическим управлением памятью[25][26], ориентированный на повышение производительности разработчика, читаемости кода и его качества, а также на обеспечение переносимости написанных на нём программ[27]. Язык является полностью объектно-ориентированным в том плане, что всё является объектами[25]. Необычной особенностью языка является выделение блоков кода пробельными отступами[28].", "short_description": "Изучение синтаксиса самого популярного языка программирования в мире!", "age_category": "FROM_14_TO_16_Y_O", "duration": "6 месяцев", "is_recomended": true, "main_image": "defautl_course_image.png"}}, {"model": "school.course", "pk": 2, "fields": {"name": "Java", "description": "Java[прим. 1] — строго типизированный объектно-ориентированный язык программирования общего назначения, разработанный компанией Sun Microsystems (в последующем приобретённой компанией Oracle). Разработка ведётся сообществом, организованным через Java Community Process; язык и основные реализующие его технологии распространяются по лицензии GPL. Права на торговую марку принадлежат корпорации Oracle.\r\n\r\nПриложения Java обычно транслируются в специальный байт-код, поэтому они могут работать на любой компьютерной архитектуре, для которой существует реализация виртуальной Java-машины. Дата официального выпуска — 23 мая 1995 года. Занимает высокие места в рейтингах популярности языков программирования (2-е место в рейтингах IEEE Spectrum (2020)[3] и TIOBE (2021)[4]).", "short_description": "Изучение одного из самых популярных языков программирования в мире!", "age_category": "FROM_14_TO_16_Y_O", "duration": "6 месяцев", "is_recomended": true, "main_image": "defautl_course_image.png"}}, {"model": "school.course", "pk": 3, "fields": {"name": "Minecraft Education Edition", "description": "Minecraft Education (рус. Minecraft: Образовательное издание) является образовательной версией Minecraft, специально разработанной для использования в классе. Она разрабатывается Mojang AB и Xbox Game Studios и содержит функции, облегчающие использование «Minecraft» в классе. Полная версия игры была выпущена 1 ноября 2016 года. Бета-тестирование проводилось с 9 июня по 1 ноября 2016 года.\r\n\r\n20 августа 2018 года Mojang объявила, что осенью 2018 года на iPad выйдет приложение Education Edition.[3] Microsoft заявила, что лицензированные пользователи смогут играть, начиная с сентября.[4] Оно было выпущено в App Store 6 сентября 2018 года.\r\n\r\n27 марта 2019 года было объявлено, что «Education Edition» будет управляться JD.com в Китае.\r\n\r\n26 июня 2020 года Mojang выпустила предварительную сборку 1.14.30.0 на Android.", "short_description": "Основы программирования прямо в любимой игре!", "age_category": "FROM_8_TO_10_Y_O", "duration": "12 месяцев", "is_recomended": true, "main_image": "defautl_course_image.png"}}, {"model": "school.course", "pk": 4, "fields": {"name": "Unity", "description": "Unity (unity в переводе с англ. — «единство», произносится как «ю́нити») — кроссплатформенная среда разработки компьютерных игр[3], разработанная американской компанией Unity Technologies. Unity позволяет создавать приложения, работающие на более чем 25 различных платформах, включающих персональные компьютеры, игровые консоли, мобильные устройства, интернет-приложения и другие[4]. Выпуск Unity состоялся в 2005 году и с того времени идёт постоянное развитие.\r\n\r\nОсновными преимуществами Unity являются наличие визуальной среды разработки, межплатформенной поддержки и модульной системы компонентов. К недостаткам относят появление сложностей при работе с многокомпонентными схемами и затруднения при подключении внешних библиотек[⇨].\r\n\r\nНа Unity написаны тысячи игр, приложений, визуализации математических моделей, которые охватывают множество платформ и жанров. При этом Unity используется как крупными разработчиками, так и независимыми студиями[⇨].", "short_description": "Unity — кроссплатформенная среда разработки компьютерных игр и приложений!", "age_category": "FROM_14_TO_16_Y_O", "duration": "5 месяцев", "is_recomended": false, "main_image": "defautl_course_image.png"}}, {"model": "school.course", "pk": 5, "fields": {"name": "Construct 2", "description": "Construct 2 позволяет создавать 2D-игры различных жанров и сложности без навыков программирования. Игры, сделанные на нём, могут быть доступны на PC, Mac, Linux, в браузерах с поддержкой HTML5, Android, iOS, Windows Phone, Blackberry 10, Amazon Appstore, Chrome Web Store, Facebook и пр.[3] Поддержка iOS и Android осуществляется благодаря технологиям CocoonJS от Ludei, directCanvas от appMobi и Intel XDK, которые используют аппаратное ускорение для увеличения производительности HTML5 игр в 5-10 раз.[4][значимость факта?]\r\n\r\nИнтерфейс программы имеет визуальный (WYSIWYG) редактор, возможно создать игру без навыков программирования. В редакторе имеются «события» (англ. events) и «действия» (англ. actions), создающие логику[прояснить] игр[5].", "short_description": "Construct 2 позволяет создавать 2D-игры различных жанров и сложности без навыков программирования.", "age_category": "FROM_10_TO_12_Y_O", "duration": "6 месяцев", "is_recomended": false, "main_image": "defautl_course_image.png"}}, {"model": "school.course", "pk": 6, "fields": {"name": "Web-мастеринг", "description": "Понятие «Вебмастеринг» тесно связано с интернет-технологиями, но им не часто пользуются. Если вы думаете, что web mastering — это некий язык программирования, то это не так. Веб-мастеринг — это деятельность, связанная с разработкой, проектированием и созданием сайтов, а также их оптимизацией и продвижением. Поэтому деятельность правильнее называть «веб-разработкой», а специалистов «веб-мастерами». Тенденции таковы, что данная область будет развиваться также стремительно, как и сейчас. Приводить известную цитату о том, что «если вас нет в интернете, то вашей организации не существует», оправдано, как и то, что некоторые организации будущего могут быть 90% представлены только в сети. И связанные с этим профессии будут актуальны, а знания необходимы и специалистам, и руководителям.", "short_description": "Веб-мастеринг - это комплекс мероприятий по разработке, созданию, оптимизации и продвижению сайтов.", "age_category": "FROM_12_TO_14_Y_O", "duration": "12 месяцев", "is_recomended": false, "main_image": "defautl_course_image.png"}}, {"model": "school.course", "pk": 7, "fields": {"name": "Unreal Engine", "description": "Unreal Engine - это игровой движок, разрабатываемый и поддерживаемый компанией Epic Games. Первой игрой на этом движке был шутер от первого лица Unreal, выпущенный в 1998 году. Хотя движок первоначально был предназначен для разработки шутеров от первого лица, его последующие версии успешно применялись в играх самых различных жанров, в том числе стелс-играх, файтингах и массовых многопользовательских ролевых онлайн-играх. В прошлом движок распространялся на условиях оплаты ежемесячной подписки; с 2015 года Unreal Engine бесплатен, но разработчики использующих его приложений обязаны перечислять 5 % роялти от общемирового дохода с некоторыми условиями[3].", "short_description": "Написанный на языке C++, движок позволяет создавать игры для большинства платформ", "age_category": "FROM_14_TO_16_Y_O", "duration": "12 месяцев", "is_recomended": false, "main_image": "defautl_course_image.png"}}, {"model": "school.course", "pk": 8, "fields": {"name": "Олимпиадное программирование", "description": "Задачное» обучение — изучение конструкции языка через решение абстрактных задач. Например, когда надо прочитать все числа из файла и подсчитать сумму нечетных.\r\nПроектное обучение, при котором учащийся получает наглядный результат своей работы, небольшой работающий «продукт».\r\nОлимпиадное программирование хорошо тем, что практиковаться можно и самостоятельно, без помощи преподавателя. Есть платформы, на которых доступно большое количество олимпиадных задач. Решаешь задачу, пишешь код, отправляешь его на проверку и тут же получаешь результат. Мгновенная обратная связь мотивирует продолжать заниматься программированием. \r\n\r\nНапример, есть сайт «Информатикс», созданный коллективом московских преподавателей олимпиадной информатики. На нём есть и теоретические материалы: например, вводные лекции по Python, к которым прикреплены примеры олимпиадных задач. Прошёл тему — и сразу выполняешь по ней задание.\r\n.", "short_description": "Олимпиадное программирование — это участие в соревнованиях по решению алгоритмов", "age_category": "FROM_14_TO_16_Y_O", "duration": "12 месяцев", "is_recomended": false, "main_image": "defautl_course_image.png"}}, {"model": "school.course", "pk": 9, "fields": {"name": "Компьютерная грамотность", "description": "Компьютерная грамотность (англ. Computer literacy) — владение минимальным набором знаний и навыков работы на компьютере, использования средств вычислительной техники; понимание основ информатики и значения информационной технологии в жизни общества.\r\n\r\nКомпьютерная грамотность даёт знания об информационном обществе и компьютеризации, умение и навыки пользования компьютером и личностных качеств, обеспечивающих успешность создания гибридного интеллекта. Позволяет широко использовать компьютер в качестве средства познавательной деятельности, расширяет возможности хранения и предъявления информации, усиливает мотивацию учения, позволяет осуществлять систематический самоконтроль и рефлексию деятельности, выполняет психотерапевтические функции, повышает самочувствие и самоутверждение.", "short_description": "Курс о владении минимальным набором знаний и навыков работы на компьютере,", "age_category": "FROM_8_TO_10_Y_O", "duration": "3 месяца", "is_recomended": false, "main_image": "defautl_course_image.png"}}]